[Timeout] StringLiteral
client/activation/common/analysisOptions.ts:19:37
 export abstract class LanguageServerAnalysisOptionsBase implements ILanguageServerAnalysisOptions {
     protected disposables: Disposable[] = [];
     protected readonly didChange = new EventEmitter<void>();
-    private envPythonPath: string = '';
+    private envPythonPath: string = "Stryker was here!";
     private readonly output: IOutputChannel;
 

[Killed] BlockStatement
client/activation/common/analysisOptions.ts:29:95
         this.output = lsOutputChannel.channel;
     }
 
-    public async initialize(_resource: Resource, _interpreter: PythonEnvironment | undefined) {
-        const disposable = this.envVarsProvider.onDidEnvironmentVariablesChange(this.onEnvVarChange, this);
-        this.disposables.push(disposable);
-    }
+    public async initialize(_resource: Resource, _interpreter: PythonEnvironment | undefined) {}
 
     public get onDidChange(): Event<void> {

[Timeout] BlockStatement
client/activation/common/analysisOptions.ts:38:28
         return this.didChange.event;
     }
 
-    public dispose(): void {
-        this.disposables.forEach((d) => d.dispose());
-        this.didChange.dispose();
-    }
+    public dispose(): void {}
 
     @traceDecorators.error('Failed to get analysis options')

[Killed] ArrowFunction
client/activation/common/analysisOptions.ts:39:34
     }
 
     public dispose(): void {
-        this.disposables.forEach((d) => d.dispose());
+        this.disposables.forEach(() => undefined);
         this.didChange.dispose();
     }

[Timeout] ObjectLiteral
client/activation/common/analysisOptions.ts:48:16
         const workspaceFolder = this.getWorkspaceFolder();
         const documentSelector = this.getDocumentFilters(workspaceFolder);
 
-        return {
-            documentSelector,
-            workspaceFolder,
-            synchronize: {
-                configurationSection: PYTHON_LANGUAGE
-            },
-            outputChannel: this.output,
-            revealOutputChannelOn: RevealOutputChannelOn.Never,
-            initializationOptions: await this.getInitializationOptions()
-        };
+        return {};
     }
 

[Survived] BlockStatement
client/activation/common/analysisOptions.ts:69:62
     }
 
     // tslint:disable-next-line: no-any
-    protected async getInitializationOptions(): Promise<any> {
-        return undefined;
-    }
+    protected async getInitializationOptions(): Promise<any> {}
 
     protected async getEnvPythonPath(): Promise<string> {

[Killed] BlockStatement
client/activation/common/analysisOptions.ts:80:38
     }
 
     @debounceSync(1000)
-    protected onEnvVarChange(): void {
-        this.notifyifEnvPythonPathChanged().ignoreErrors();
-    }
+    protected onEnvVarChange(): void {}
 
     protected async notifyifEnvPythonPathChanged(): Promise<void> {

[Survived] BlockStatement
client/activation/common/analysisOptions.ts:84:67
         this.notifyifEnvPythonPathChanged().ignoreErrors();
     }
 
-    protected async notifyifEnvPythonPathChanged(): Promise<void> {
-        const vars = await this.envVarsProvider.getEnvironmentVariables();
-        const envPythonPath = vars.PYTHONPATH || '';
-
-        if (this.envPythonPath !== envPythonPath) {
-            this.didChange.fire();
-        }
-    }
+    protected async notifyifEnvPythonPathChanged(): Promise<void> {}
 }
 

[Survived] LogicalOperator
client/activation/common/analysisOptions.ts:86:31
 
     protected async notifyifEnvPythonPathChanged(): Promise<void> {
         const vars = await this.envVarsProvider.getEnvironmentVariables();
-        const envPythonPath = vars.PYTHONPATH || '';
+        const envPythonPath = vars.PYTHONPATH && '';
 
         if (this.envPythonPath !== envPythonPath) {

[Killed] BlockStatement
client/activation/common/analysisOptions.ts:88:51
         const vars = await this.envVarsProvider.getEnvironmentVariables();
         const envPythonPath = vars.PYTHONPATH || '';
 
-        if (this.envPythonPath !== envPythonPath) {
-            this.didChange.fire();
-        }
+        if (this.envPythonPath !== envPythonPath) {}
     }
 }

[Killed] ConditionalExpression
client/activation/common/analysisOptions.ts:88:13
         const vars = await this.envVarsProvider.getEnvironmentVariables();
         const envPythonPath = vars.PYTHONPATH || '';
 
-        if (this.envPythonPath !== envPythonPath) {
+        if (true) {
             this.didChange.fire();
         }
