[Killed] StringLiteral
client/activation/languageServer/analysisOptions.ts:21:44
 export class DotNetLanguageServerAnalysisOptions extends LanguageServerAnalysisOptionsBase {
     private resource: Resource;
     private interpreter: PythonEnvironment | undefined;
-    private languageServerFolder: string = '';
+    private languageServerFolder: string = "Stryker was here!";
     private excludedFiles: string[] = [];
     private typeshedPaths: string[] = [];

[Killed] ArrayDeclaration
client/activation/languageServer/analysisOptions.ts:22:39
     private resource: Resource;
     private interpreter: PythonEnvironment | undefined;
     private languageServerFolder: string = '';
-    private excludedFiles: string[] = [];
+    private excludedFiles: string[] = ["Stryker was here"];
     private typeshedPaths: string[] = [];
 

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:37:93
         super(envVarsProvider, lsOutputChannel);
     }
 
-    public async initialize(resource: Resource, interpreter: PythonEnvironment | undefined) {
-        await super.initialize(resource, interpreter);
-
-        this.resource = resource;
-        this.interpreter = interpreter;
-        this.languageServerFolder = await this.languageServerFolderService.getLanguageServerFolderName(resource);
-
-        const disposable = this.workspace.onDidChangeConfiguration(this.onSettingsChangedHandler, this);
-        this.disposables.push(disposable);
-    }
+    public async initialize(resource: Resource, interpreter: PythonEnvironment | undefined) {}
 
     protected getWorkspaceFolder(): WorkspaceFolder | undefined {

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:59:13
         if (
             workspaceFolder &&
             Array.isArray(this.workspace.workspaceFolders) &&
-            this.workspace.workspaceFolders.length > 1
+            true
         ) {
             filters[0].pattern = `${workspaceFolder.uri.fsPath}/**/*`;

[Killed] EqualityOperator
client/activation/languageServer/analysisOptions.ts:59:13
         if (
             workspaceFolder &&
             Array.isArray(this.workspace.workspaceFolders) &&
-            this.workspace.workspaceFolders.length > 1
+            this.workspace.workspaceFolders.length >= 1
         ) {
             filters[0].pattern = `${workspaceFolder.uri.fsPath}/**/*`;

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:60:11
             workspaceFolder &&
             Array.isArray(this.workspace.workspaceFolders) &&
             this.workspace.workspaceFolders.length > 1
-        ) {
-            filters[0].pattern = `${workspaceFolder.uri.fsPath}/**/*`;
-        }
+        ) {}
 
         return filters;

[Killed] StringLiteral
client/activation/languageServer/analysisOptions.ts:72:25
 
         const interpreterInfo = this.interpreter;
         if (!interpreterInfo) {
-            throw Error('did not find an active interpreter');
+            throw Error("");
         }
 

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:78:22
         properties.InterpreterPath = interpreterInfo.path;
 
         const version = interpreterInfo.version;
-        if (version) {
-            properties.Version = `${version.major}.${version.minor}.${version.patch}`;
-        } else {
+        if (version) {} else {
             traceError('Unable to determine Python version. Analysis may be limited.');
         }

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:80:16
         const version = interpreterInfo.version;
         if (version) {
             properties.Version = `${version.major}.${version.minor}.${version.patch}`;
-        } else {
-            traceError('Unable to determine Python version. Analysis may be limited.');
-        }
+        } else {}
 
         let searchPaths = [];

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:87:13
         let searchPaths = [];
 
         const settings = this.configuration.getSettings(this.resource);
-        if (settings.autoComplete) {
+        if (false) {
             const extraPaths = settings.autoComplete.extraPaths;
             if (extraPaths && extraPaths.length > 0) {

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:87:36
         let searchPaths = [];
 
         const settings = this.configuration.getSettings(this.resource);
-        if (settings.autoComplete) {
-            const extraPaths = settings.autoComplete.extraPaths;
-            if (extraPaths && extraPaths.length > 0) {
-                searchPaths.push(...extraPaths);
-            }
-        }
+        if (settings.autoComplete) {}
 
         const envPythonPath = await this.getEnvPythonPath();

[Killed] EqualityOperator
client/activation/languageServer/analysisOptions.ts:89:31
         const settings = this.configuration.getSettings(this.resource);
         if (settings.autoComplete) {
             const extraPaths = settings.autoComplete.extraPaths;
-            if (extraPaths && extraPaths.length > 0) {
+            if (extraPaths && extraPaths.length <= 0) {
                 searchPaths.push(...extraPaths);
             }

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:89:17
         const settings = this.configuration.getSettings(this.resource);
         if (settings.autoComplete) {
             const extraPaths = settings.autoComplete.extraPaths;
-            if (extraPaths && extraPaths.length > 0) {
+            if (true) {
                 searchPaths.push(...extraPaths);
             }

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:95:13
         }
 
         const envPythonPath = await this.getEnvPythonPath();
-        if (envPythonPath !== '') {
+        if (false) {
             const paths = envPythonPath.split(this.pathUtils.delimiter).filter((item) => item.trim().length > 0);
             searchPaths.push(...paths);

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:95:35
         }
 
         const envPythonPath = await this.getEnvPythonPath();
-        if (envPythonPath !== '') {
-            const paths = envPythonPath.split(this.pathUtils.delimiter).filter((item) => item.trim().length > 0);
-            searchPaths.push(...paths);
-        }
+        if (envPythonPath !== '') {}
 
         searchPaths = searchPaths.map((p) => path.normalize(p));

[Killed] EqualityOperator
client/activation/languageServer/analysisOptions.ts:96:90
 
         const envPythonPath = await this.getEnvPythonPath();
         if (envPythonPath !== '') {
-            const paths = envPythonPath.split(this.pathUtils.delimiter).filter((item) => item.trim().length > 0);
+            const paths = envPythonPath.split(this.pathUtils.delimiter).filter((item) => item.trim().length >= 0);
             searchPaths.push(...paths);
         }

[Killed] ArrowFunction
client/activation/languageServer/analysisOptions.ts:96:80
 
         const envPythonPath = await this.getEnvPythonPath();
         if (envPythonPath !== '') {
-            const paths = envPythonPath.split(this.pathUtils.delimiter).filter((item) => item.trim().length > 0);
+            const paths = envPythonPath.split(this.pathUtils.delimiter).filter(() => undefined);
             searchPaths.push(...paths);
         }

[Killed] ArrowFunction
client/activation/languageServer/analysisOptions.ts:100:39
             searchPaths.push(...paths);
         }
 
-        searchPaths = searchPaths.map((p) => path.normalize(p));
+        searchPaths = searchPaths.map(() => undefined);
 
         this.excludedFiles = this.getExcludedFiles();

[Killed] ObjectLiteral
client/activation/languageServer/analysisOptions.ts:106:26
         this.typeshedPaths = this.getTypeshedPaths();
 
         return {
-            interpreter: {
-                properties
-            },
+            interpreter: {},
             searchPaths,
             typeStubSearchPaths: this.typeshedPaths,

[Killed] ArrayDeclaration
client/activation/languageServer/analysisOptions.ts:117:32
     }
 
     protected getExcludedFiles(): string[] {
-        const list: string[] = ['**/Lib/**', '**/site-packages/**'];
+        const list: string[] = [];
         this.getVsCodeExcludeSection('search.exclude', list);
         this.getVsCodeExcludeSection('files.exclude', list);

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:125:78
         return list;
     }
 
-    protected getVsCodeExcludeSection(setting: string, list: string[]): void {
-        const states = this.workspace.getConfiguration(setting);
-        if (states) {
-            Object.keys(states)
-                .filter((k) => (k.indexOf('*') >= 0 || k.indexOf('/') >= 0) && states[k])
-                .forEach((p) => list.push(p));
-        }
-    }
+    protected getVsCodeExcludeSection(setting: string, list: string[]): void {}
 
     protected getPythonExcludeSection(list: string[]): void {

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:127:21
 
     protected getVsCodeExcludeSection(setting: string, list: string[]): void {
         const states = this.workspace.getConfiguration(setting);
-        if (states) {
-            Object.keys(states)
-                .filter((k) => (k.indexOf('*') >= 0 || k.indexOf('/') >= 0) && states[k])
-                .forEach((p) => list.push(p));
-        }
+        if (states) {}
     }
 

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:127:13
 
     protected getVsCodeExcludeSection(setting: string, list: string[]): void {
         const states = this.workspace.getConfiguration(setting);
-        if (states) {
+        if (false) {
             Object.keys(states)
                 .filter((k) => (k.indexOf('*') >= 0 || k.indexOf('/') >= 0) && states[k])

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:129:33
         const states = this.workspace.getConfiguration(setting);
         if (states) {
             Object.keys(states)
-                .filter((k) => (k.indexOf('*') >= 0 || k.indexOf('/') >= 0) && states[k])
+                .filter((k) => (false) && states[k])
                 .forEach((p) => list.push(p));
         }

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:129:33
         const states = this.workspace.getConfiguration(setting);
         if (states) {
             Object.keys(states)
-                .filter((k) => (k.indexOf('*') >= 0 || k.indexOf('/') >= 0) && states[k])
+                .filter((k) => (false || k.indexOf('/') >= 0) && states[k])
                 .forEach((p) => list.push(p));
         }

[Killed] ArrowFunction
client/activation/languageServer/analysisOptions.ts:130:26
         if (states) {
             Object.keys(states)
                 .filter((k) => (k.indexOf('*') >= 0 || k.indexOf('/') >= 0) && states[k])
-                .forEach((p) => list.push(p));
+                .forEach(() => undefined);
         }
     }

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:134:61
         }
     }
 
-    protected getPythonExcludeSection(list: string[]): void {
-        const pythonSettings = this.configuration.getSettings(this.resource);
-        const paths = pythonSettings && pythonSettings.linting ? pythonSettings.linting.ignorePatterns : undefined;
-        if (paths && Array.isArray(paths)) {
-            paths.filter((p) => p && p.length > 0).forEach((p) => list.push(p));
-        }
-    }
+    protected getPythonExcludeSection(list: string[]): void {}
 
     protected getTypeshedPaths(): string[] {

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:136:23
 
     protected getPythonExcludeSection(list: string[]): void {
         const pythonSettings = this.configuration.getSettings(this.resource);
-        const paths = pythonSettings && pythonSettings.linting ? pythonSettings.linting.ignorePatterns : undefined;
+        const paths = false ? pythonSettings.linting.ignorePatterns : undefined;
         if (paths && Array.isArray(paths)) {
             paths.filter((p) => p && p.length > 0).forEach((p) => list.push(p));

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:136:23
 
     protected getPythonExcludeSection(list: string[]): void {
         const pythonSettings = this.configuration.getSettings(this.resource);
-        const paths = pythonSettings && pythonSettings.linting ? pythonSettings.linting.ignorePatterns : undefined;
+        const paths = true ? pythonSettings.linting.ignorePatterns : undefined;
         if (paths && Array.isArray(paths)) {
             paths.filter((p) => p && p.length > 0).forEach((p) => list.push(p));

[Killed] LogicalOperator
client/activation/languageServer/analysisOptions.ts:137:13
     protected getPythonExcludeSection(list: string[]): void {
         const pythonSettings = this.configuration.getSettings(this.resource);
         const paths = pythonSettings && pythonSettings.linting ? pythonSettings.linting.ignorePatterns : undefined;
-        if (paths && Array.isArray(paths)) {
+        if (paths || Array.isArray(paths)) {
             paths.filter((p) => p && p.length > 0).forEach((p) => list.push(p));
         }

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:137:44
     protected getPythonExcludeSection(list: string[]): void {
         const pythonSettings = this.configuration.getSettings(this.resource);
         const paths = pythonSettings && pythonSettings.linting ? pythonSettings.linting.ignorePatterns : undefined;
-        if (paths && Array.isArray(paths)) {
-            paths.filter((p) => p && p.length > 0).forEach((p) => list.push(p));
-        }
+        if (paths && Array.isArray(paths)) {}
     }
 

[Killed] ArrowFunction
client/activation/languageServer/analysisOptions.ts:138:60
         const pythonSettings = this.configuration.getSettings(this.resource);
         const paths = pythonSettings && pythonSettings.linting ? pythonSettings.linting.ignorePatterns : undefined;
         if (paths && Array.isArray(paths)) {
-            paths.filter((p) => p && p.length > 0).forEach((p) => list.push(p));
+            paths.filter((p) => p && p.length > 0).forEach(() => undefined);
         }
     }

[Killed] EqualityOperator
client/activation/languageServer/analysisOptions.ts:138:38
         const pythonSettings = this.configuration.getSettings(this.resource);
         const paths = pythonSettings && pythonSettings.linting ? pythonSettings.linting.ignorePatterns : undefined;
         if (paths && Array.isArray(paths)) {
-            paths.filter((p) => p && p.length > 0).forEach((p) => list.push(p));
+            paths.filter((p) => p && p.length <= 0).forEach((p) => list.push(p));
         }
     }

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:144:16
 
     protected getTypeshedPaths(): string[] {
         const settings = this.configuration.getSettings(this.resource);
-        return settings.analysis.typeshedPaths && settings.analysis.typeshedPaths.length > 0
+        return true
             ? settings.analysis.typeshedPaths
             : [path.join(this.context.extensionPath, this.languageServerFolder, 'Typeshed')];

[Killed] EqualityOperator
client/activation/languageServer/analysisOptions.ts:144:51
 
     protected getTypeshedPaths(): string[] {
         const settings = this.configuration.getSettings(this.resource);
-        return settings.analysis.typeshedPaths && settings.analysis.typeshedPaths.length > 0
+        return settings.analysis.typeshedPaths && settings.analysis.typeshedPaths.length >= 0
             ? settings.analysis.typeshedPaths
             : [path.join(this.context.extensionPath, this.languageServerFolder, 'Typeshed')];

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:151:16
 
     protected getCacheFolderPath(): string | null {
         const settings = this.configuration.getSettings(this.resource);
-        return settings.analysis.cacheFolderPath && settings.analysis.cacheFolderPath.length > 0
+        return false
             ? settings.analysis.cacheFolderPath
             : null;

[Killed] EqualityOperator
client/activation/languageServer/analysisOptions.ts:151:53
 
     protected getCacheFolderPath(): string | null {
         const settings = this.configuration.getSettings(this.resource);
-        return settings.analysis.cacheFolderPath && settings.analysis.cacheFolderPath.length > 0
+        return settings.analysis.cacheFolderPath && settings.analysis.cacheFolderPath.length >= 0
             ? settings.analysis.cacheFolderPath
             : null;

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:156:91
             : null;
     }
 
-    protected async onSettingsChangedHandler(e?: ConfigurationChangeEvent): Promise<void> {
-        if (e && !e.affectsConfiguration('python', this.resource)) {
-            return;
-        }
-        this.onSettingsChanged();
-    }
+    protected async onSettingsChangedHandler(e?: ConfigurationChangeEvent): Promise<void> {}
 
     @debounceSync(1000)

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:157:13
     }
 
     protected async onSettingsChangedHandler(e?: ConfigurationChangeEvent): Promise<void> {
-        if (e && !e.affectsConfiguration('python', this.resource)) {
+        if (true) {
             return;
         }

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:157:68
     }
 
     protected async onSettingsChangedHandler(e?: ConfigurationChangeEvent): Promise<void> {
-        if (e && !e.affectsConfiguration('python', this.resource)) {
-            return;
-        }
+        if (e && !e.affectsConfiguration('python', this.resource)) {}
         this.onSettingsChanged();
     }

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:164:41
     }
 
     @debounceSync(1000)
-    protected onSettingsChanged(): void {
-        this.notifyIfSettingsChanged().ignoreErrors();
-    }
+    protected onSettingsChanged(): void {}
 
     @traceDecorators.verbose('Changes in python settings detected in analysis options')

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:169:62
     }
 
     @traceDecorators.verbose('Changes in python settings detected in analysis options')
-    protected async notifyIfSettingsChanged(): Promise<void> {
-        const excludedFiles = this.getExcludedFiles();
-        await this.notifyIfValuesHaveChanged(this.excludedFiles, excludedFiles);
-
-        const typeshedPaths = this.getTypeshedPaths();
-        await this.notifyIfValuesHaveChanged(this.typeshedPaths, typeshedPaths);
-    }
+    protected async notifyIfSettingsChanged(): Promise<void> {}
 
     protected async notifyIfValuesHaveChanged(oldArray: string[], newArray: string[]): Promise<void> {

[Killed] BlockStatement
client/activation/languageServer/analysisOptions.ts:177:102
         await this.notifyIfValuesHaveChanged(this.typeshedPaths, typeshedPaths);
     }
 
-    protected async notifyIfValuesHaveChanged(oldArray: string[], newArray: string[]): Promise<void> {
-        if (newArray.length !== oldArray.length) {
-            this.didChange.fire();
-            return;
-        }
-
-        for (let i = 0; i < oldArray.length; i += 1) {
-            if (oldArray[i] !== newArray[i]) {
-                this.didChange.fire();
-                return;
-            }
-        }
-    }
+    protected async notifyIfValuesHaveChanged(oldArray: string[], newArray: string[]): Promise<void> {}
 }
 

[Killed] EqualityOperator
client/activation/languageServer/analysisOptions.ts:178:13
     }
 
     protected async notifyIfValuesHaveChanged(oldArray: string[], newArray: string[]): Promise<void> {
-        if (newArray.length !== oldArray.length) {
+        if (newArray.length === oldArray.length) {
             this.didChange.fire();
             return;

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:178:13
     }
 
     protected async notifyIfValuesHaveChanged(oldArray: string[], newArray: string[]): Promise<void> {
-        if (newArray.length !== oldArray.length) {
+        if (false) {
             this.didChange.fire();
             return;

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:183:25
             return;
         }
 
-        for (let i = 0; i < oldArray.length; i += 1) {
+        for (let i = 0; false; i += 1) {
             if (oldArray[i] !== newArray[i]) {
                 this.didChange.fire();

[Killed] EqualityOperator
client/activation/languageServer/analysisOptions.ts:183:25
             return;
         }
 
-        for (let i = 0; i < oldArray.length; i += 1) {
+        for (let i = 0; i <= oldArray.length; i += 1) {
             if (oldArray[i] !== newArray[i]) {
                 this.didChange.fire();

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:184:17
         }
 
         for (let i = 0; i < oldArray.length; i += 1) {
-            if (oldArray[i] !== newArray[i]) {
+            if (true) {
                 this.didChange.fire();
                 return;

[Killed] ConditionalExpression
client/activation/languageServer/analysisOptions.ts:184:17
         }
 
         for (let i = 0; i < oldArray.length; i += 1) {
-            if (oldArray[i] !== newArray[i]) {
+            if (false) {
                 this.didChange.fire();
                 return;
