[Killed] BlockStatement
client/activation/node/analysisOptions.ts:18:48
         super(envVarsProvider, lsOutputChannel);
     }
 
-    protected async getInitializationOptions() {
-        return {
-            experimentationSupport: true
-        };
-    }
+    protected async getInitializationOptions() {}
 }
 

[Killed] ObjectLiteral
client/activation/node/analysisOptions.ts:19:16
     }
 
     protected async getInitializationOptions() {
-        return {
-            experimentationSupport: true
-        };
+        return {};
     }
 }

[Killed] BooleanLiteral
client/activation/node/analysisOptions.ts:20:37
 
     protected async getInitializationOptions() {
         return {
-            experimentationSupport: true
+            experimentationSupport: false
         };
     }
